## Institut des Algorithmes du Sénégal

## TP1

Dans ce premier TP, nous allons mettre en application les connaissaces acquises lors de la première session.

Concrétement, vous serez appeller à executer les taches suivantes :

## 1. Importer les libraries nécéssaires

## 2. Charger les données

## 3. Afficher les 10 premières lignes des données

## 5. Afficher les colonnes du dataframe

## 6. Afficher toutes les colonnes ayant des valeurs manquantes

## 7. Dans ce cas d'étude, la variables cible est "survived". Visualisez la matrice de corrélation permettant d'étudier la relation entre cette variable cible et toutes les autres variuables
Questions supplémentaires :

1. Afficher les 5 dernières ligne du dataframe 

2. Mettre les éléments de la premieres colonne dans une liste 

3. Convertir cette liste en dataframe 

4. Comparer le nombre de lignes de ce dernier dataframe avec celui du premier dataframe

In [27]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\user-pc\anaconda3\lib\site-packages (1.1.3)
Requirement already satisfied: numpy>=1.15.4 in c:\users\user-pc\anaconda3\lib\site-packages (from pandas) (1.19.2)
Requirement already satisfied: pytz>=2017.2 in c:\users\user-pc\anaconda3\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\user-pc\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in c:\users\user-pc\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [34]:
!pip install numpy
!pip install display

Requirement already satisfied: numpy in c:\users\user-pc\anaconda3\lib\site-packages (1.19.2)
Collecting display
  Downloading display-1.0.0.tar.gz (687 bytes)
Building wheels for collected packages: display
  Building wheel for display (setup.py): started
  Building wheel for display (setup.py): finished with status 'done'
  Created wheel for display: filename=display-1.0.0-py3-none-any.whl size=1408 sha256=99ce9345f65ce03aafced26e56c13c2cb2d12b7ced9e8d2ead640744ac2722bb
  Stored in directory: c:\users\user-pc\appdata\local\pip\cache\wheels\ed\69\01\48bc8f68190d629c2fef3462c4762423d8d4c69012fe8cfb0c
Successfully built display
Installing collected packages: display
Successfully installed display-1.0.0

In [39]:
import pandas as pd
import numpy as np
from IPython.display import display

In [40]:
dataframe = pd.read_csv("titanic.csv")

In [41]:
dataframe.head(10)

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [60]:
dataframe.shape

(891, 11)

In [74]:
dataframe.columns

Index(['survived', 'pclass', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked'],
      dtype='object')

In [78]:
dataframe.columns[dataframe.isnull().any()]

Index(['age', 'cabin', 'embarked'], dtype='object')

In [80]:
dataframe.isnull().any

<bound method DataFrame.any of      survived  pclass   name    sex    age  sibsp  parch  ticket   fare  \
0       False   False  False  False  False  False  False   False  False
1       False   False  False  False  False  False  False   False  False
2       False   False  False  False  False  False  False   False  False
3       False   False  False  False  False  False  False   False  False
4       False   False  False  False  False  False  False   False  False
..        ...     ...    ...    ...    ...    ...    ...     ...    ...
886     False   False  False  False  False  False  False   False  False
887     False   False  False  False  False  False  False   False  False
888     False   False  False  False   True  False  False   False  False
889     False   False  False  False  False  False  False   False  False
890     False   False  False  False  False  False  False   False  False

     cabin  embarked
0     True     False
1    False     False
2     True     False
3    False     False
4     True     False
..     ...       ...
886   True     False
887  False     False
888   True     False
889  False     False
890   True     False

[891 rows x 11 columns]>

In [83]:
dataframe.tail(20)

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
871,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
873,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,9.0000,NaN,S
874,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
875,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
876,0,3,"Gustafsson, Mr. Alfred Ossian",male,20.0,0,0,7534,9.8458,NaN,S
877,0,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,7.8958,NaN,S
878,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
879,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
880,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
881,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q